{-
это
многострочный
комментарий
-}

-- это однострочный комментарий

{-
команда для запуска интерактивной среды в терминале:
ghci

загрузка содержимого файла в интерактивную среду (:l ≡ :load):
:l lec02add.hs

перезагрузка текущего файла в среду (:r ≡ :reload):
:r

запрос типа выражения:
:t

выход из интерактивной среды (:q ≡ :quit):
:q 
-}

myFun = (\x  y z -> x y z)
{-
запросите тип выражения myFun в интерактивной среде:
:t myFun
myFun :: (t1 -> t2 -> t3) -> t1 -> t2 -> t3

выполните вычисление со следующими аргументами:
myFun (*) 2 3
6
сколько у функции myFun аргументов? какие типы у переданных аргументов?
у функции myFun 3 аргумента: x - функция, y и z - любой тип
myFun (*) 2 3 :: Num t3 => t3

выполните вычисление со следующими аргументами:
myFun (\x -> x) (\y -> y) "Hello world"
сколько у функции myFun аргументов? какие типы у переданных аргументов?
у функции также 3 аргумента, ????
myFun (\x -> x) (\y -> y) "Hello world" :: String

почему работают оба выражения? 
т.к. типа полимофрные

запросите тип выражения myFun в интерактивной среде:
:t (myFun (*))
(myFun (*)) :: Num t3 => t3 -> t3 -> t3

:t (myFun (\x -> x))
(myFun (\x -> x)) :: (t2 -> t3) -> t2 -> t3

:t (myFun (*) 2)
(myFun (*) 2) :: Num t3 => t3 -> t3

:t (myFun (\x -> x) (\y -> y))
(myFun (\x -> x) (\y -> y)) :: t3 -> t3

-}
{-

запишите комбинаторы в виде λ-выражений
I = λx. x
i x = x

ω = λx. x x
w x = x ????

Ω = ω ω = (λx. x x)(λx. x x)
????

K = λx y. x
k x y = x

K∗ = λx y. y
k* x y = y

C = λf x y. f y x
c f x y = f y x

B = λf g x. f (g x)
b f g x = f (g x)

S = λf g x. f x (g x)

запросите типы у интерактивной среды :t ... 

передайте такие аргументы, чтобы получить результат в виде значения
передайте такие аргументы, чтобы НЕ получить результат в виде значения (какие ошибки выдает среда, как их исправить?)

-}


-- возьмите выражения из задания по редукции термов и попробуйте довести их до значения в терминале путем добавления аргументов

???????????????????????????