module Main (main) where

import System.Environment (getArgs)
import Game (runGameFromFile)

main :: IO ()
main = do
    args <- getArgs
    case args of
        [path] -> runGameFromFile path
        _ -> putStrLn "Usage: maze-game <path-to-maze-file>"

{-
    Работа выполнена с использованием DeepSeek-V3

    Промт:
        1) 
            на основе лекции мне нужно выполнить практическое задание 
            Реализуйте текстовую игру прохождение лабиринта:
                - создайте проект в stack
                - Напишите собственный трансформер монад MyStateT и используйте его в дальнейшей разработке
                - Используйте три трансформера для доступа к внешнему окружению, логирования действий пользователя и мутабельного состояния игрока
                - Явно терминируйте трансформеры
                - Явно используйте lift
                - Карта лабиринта загружается из текстового файла
                - Каждая комната имеет уникальное название
                - Игрок может запросить названия соседних комнат, переместиться в одну соседнюю комнату или завершить игру
                - Игрок начинает из комнаты с названием старт
                - Игра заканчивается в комнате с названием финиш
                - Все перемещения игрока логируются и выводятся на экран после завершения игры
        2)
            нужно убрать errors и warnings при сборке проекта
        3) 
            увелить лабиринт. вывод соседних комнат отображается не корректно
        
-}